Pandas can read and write to various SQL engines through the use of a driver and the sqlalchemy python library.

# How can we connect with the SQL database using python 
Step 1:
 Figure out what SQL Engine you are connecting to, for just a few examples:
     PostgreSQL
     MySQL
     MS SQL Server

Step 2: 
    Install the appropriate Python driver library

For PostgreSQL - psycopg2

For MySQL - pymysql

Foe MS SQL Server - pyodbc

Step 3:  Use the sqlalchemy library to connect your SQL database with the driver

Step 4: Use the sqlalchemy driver connection with pandas read_sql method.
    Pandas can read in entire tables as a DataFrame or actual parse a SQL query through the connection:
    SELECT*FROM table;

In [3]:
import pandas as pd 
import numpy as np

In [4]:
from sqlalchemy import create_engine

In [5]:
temp_db = create_engine('sqlite:///:memory:')

In [22]:
df=pd.DataFrame(data=np.random.randint(0,100,(4,4)),columns=['a','b','c','d'])

In [23]:
df

    a   b   c   d
0  98  59  37  71
1  73   7  33  54
2  31   7  83  12
3  27  49  42  19

In [24]:
df.to_sql('new_table1', temp_db)

In [25]:
new_df=pd.read_sql('new_table1',temp_db )

In [26]:
new_df

   index   a   b   c   d
0      0  98  59  37  71
1      1  73   7  33  54
2      2  31   7  83  12
3      3  27  49  42  19

In [28]:
query_df=pd.read_sql_query("SELECT a,c FROM new_table1",temp_db)

In [29]:
query_df

    a   c
0  98  37
1  73  33
2  31  83
3  27  42